In [2]:
import numpy as np
import pandas as pd
df = pd.read_excel('file_example_XLS_100.xls')

PRINT DATAFRAME STRUCTURE

In [4]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   0           100 non-null    int64
 1   First Name  100 non-null    object
 2   Last Name   100 non-null    object
 3   Gender      100 non-null    object
 4   Country     100 non-null    object
 5   Age         100 non-null    int64
 6   Date        100 non-null    object
 7   Id          100 non-null    int64
dtypes: int64(3), object(5)
memory usage: 6.4+ KB
None

PRINT DATAFRAME SAMPLE

In [23]:
print(df.sample(5))

     0 First Name Last Name  Gender        Country  Age        Date    Id
82  83       Jona   Grindle  Female  Great Britain   26  21/05/2015  6458
9   10     Fallon   Winward  Female  Great Britain   28  16/08/2016  5486
37  38        Sau      Pfau  Female  United States   25  21/05/2015  9536
34  35     Dewitt    Borger    Male  United States   36  21/05/2015  8514
89  90      Chase    Karner    Male  United States   37  15/10/2017  2154

PRINT DATAFRAME AGE MEAN GROUPEDBY GENDER

In [12]:
print(df.groupby('Gender')['Age'].mean())

                0        Age           Id
Gender
Female  49.552632  33.921053  4967.157895
Male    53.500000  31.166667  3927.833333

PRINT COUNTRYWISE ID COUNT

In [14]:
print(df.groupby('Country')['Id'].count())

Country
France           24
Great Britain    28
United States    48
Name: Id, dtype: int64

PRINT Unique DATES Count

In [22]:
print(df['Date'].unique().size)

3
      0 First Name   Last Name  Gender        Country  Age        Date    Id
0     1      Dulce       Abril  Female  United States   32  15/10/2017  1562
1     2       Mara   Hashimoto  Female  Great Britain   25  16/08/2016  1582
2     3     Philip        Gent    Male         France   36  21/05/2015  2587
3     4   Kathleen      Hanner  Female  United States   25  15/10/2017  3549
4     5    Nereida     Magwood  Female  United States   58  16/08/2016  2468
..  ...        ...         ...     ...            ...  ...         ...   ...
95   96       Roma  Lafollette  Female  United States   34  15/10/2017  2654
96   97     Felisa        Cail  Female  United States   28  16/08/2016  6525
97   98   Demetria       Abbey  Female  United States   32  21/05/2015  3265
98   99     Jeromy        Danz    Male  United States   39  15/10/2017  3265
99  100   Rasheeda      Alkire  Female  United States   29  16/08/2016  6125

[100 rows x 8 columns]

FIND Last NAME OF 'JONA', 'CHASE' OR 'FALLON'

In [35]:
print(df[df['First Name'] == 'Jona']['Last Name'])
print(df[df['First Name'] == 'Chase']['Last Name'])
print(df[df['First Name'] == 'Fallon']['Last Name'])

32    Grindle
82    Grindle
Name: Last Name, dtype: object
39    Karner
89    Karner
Name: Last Name, dtype: object
9     Winward
59    Winward
Name: Last Name, dtype: object

PRINT COUNT OF UNIQUE RECORDS

In [40]:
print(df.iloc[:,2:].drop_duplicates().count())

Last Name    50
Gender       50
Country      50
Age          50
Date         50
Id           50
dtype: int64

PRINT FEMALES WITH AGE LESS THAN 26

In [49]:
print(df.where(pd.to_numeric(df['Age']) < 26).sample(10))

       0 First Name Last Name  Gender Country   Age        Date      Id
69   NaN        NaN       NaN     NaN     NaN   NaN         NaN     NaN
25   NaN        NaN       NaN     NaN     NaN   NaN         NaN     NaN
31   NaN        NaN       NaN     NaN     NaN   NaN         NaN     NaN
93   NaN        NaN       NaN     NaN     NaN   NaN         NaN     NaN
7    NaN        NaN       NaN     NaN     NaN   NaN         NaN     NaN
88   NaN        NaN       NaN     NaN     NaN   NaN         NaN     NaN
65  66.0   Shavonne       Pia  Female  France  24.0  21/05/2015  1546.0
59   NaN        NaN       NaN     NaN     NaN   NaN         NaN     NaN
41   NaN        NaN       NaN     NaN     NaN   NaN         NaN     NaN
74  75.0     Lester   Prothro    Male  France  21.0  15/10/2017  6574.0